benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pgcat_readonly_connect_c100_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 100
number of threads: 64
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 3134
number of failed transactions: 0 (0.000%)
latency average = 1033.971 ms
average connection time = 657.477 ms
tps = 96.714476 (including reconnection times)