benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pgcat_readonly_connect_c1_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 3411
number of failed transactions: 0 (0.000%)
latency average = 8.796 ms
average connection time = 8.402 ms
tps = 113.682421 (including reconnection times)