benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pgcat_readonly_connect_c25_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 25
number of threads: 25
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 5790
number of failed transactions: 0 (0.000%)
latency average = 129.715 ms
average connection time = 128.822 ms
tps = 192.729767 (including reconnection times)