benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pgcat_readonly_connect_c25_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 25
number of threads: 25
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 5352
number of failed transactions: 0 (0.000%)
latency average = 149.523 ms
average connection time = 148.790 ms
tps = 167.198378 (including reconnection times)