benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pgcat_readonly_steady_c250_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 250
number of threads: 64
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 5610433
number of failed transactions: 0 (0.000%)
latency average = 2.626 ms
initial connection time = 1077.865 ms
tps = 95206.064155 (without initial connection time)