benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pgcat_tpcb_steady_c100_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 100
number of threads: 64
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 522598
number of failed transactions: 0 (0.000%)
latency average = 11.396 ms
initial connection time = 459.520 ms
tps = 8774.741369 (without initial connection time)