benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pool_readonly_connect_c100_r3.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 100
number of threads: 64
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 6180
number of failed transactions: 0 (0.000%)
latency average = 487.367 ms
average connection time = 309.804 ms
tps = 205.184324 (including reconnection times)