benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pool_readonly_connect_c50_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 7525
number of failed transactions: 0 (0.000%)
latency average = 200.576 ms
average connection time = 198.617 ms
tps = 249.281564 (including reconnection times)