benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pool_readonly_steady_c250_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 250
number of threads: 64
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 3408308
number of failed transactions: 0 (0.000%)
latency average = 4.339 ms
initial connection time = 845.507 ms
tps = 57612.331062 (without initial connection time)