benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pool_tpcb_steady_c100_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 100
number of threads: 64
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 542628
number of failed transactions: 0 (0.000%)
latency average = 10.959 ms
initial connection time = 553.948 ms
tps = 9125.037164 (without initial connection time)