benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pool_tpcb_steady_c250_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 250
number of threads: 64
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 537283
number of failed transactions: 0 (0.000%)
latency average = 27.416 ms
initial connection time = 1113.226 ms
tps = 9118.607373 (without initial connection time)