benchmark-results/tcp-pool-100conns/pgbench_stdout/proxy_pool_tpcb_steady_c50_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 544389
number of failed transactions: 0 (0.000%)
latency average = 5.497 ms
initial connection time = 161.536 ms
tps = 9096.624142 (without initial connection time)